# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 100 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 768]
  s: [0.33, 0.50, 768]
  m: [0.67, 0.75, 768]
  l: [0.67, 1.00, 768]
  x: [1.00, 1.00, 768]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]] # 0-P1/2

  - [-1, 1, Conv, [96, 3, 2]] # 1-P2/4
  - [-1, 3, CheapC1, [96, 'UIB', 'CheapConv']] # dim, block_type: IB, UIB, ConvNeXt, conv_type: DWConv, CheapConv, PConv, InceptionDWConv

  - [-1, 1, Conv, [192, 3, 2]] # 3-P3/8
  - [-1, 3, CheapC1, [192, 'UIB', 'CheapConv']]

  - [-1, 1, Conv, [384, 3, 2]] # 5-P4/16
  - [-1, 9, CheapC1, [384, 'UIB', 'CheapConv']]

  - [-1, 1, Conv, [768, 3, 2]] # 7-P5/32
  - [-1, 3, CheapC1, [768, 'UIB', 'CheapConv']]

  - [-1, 1, SPPF, [768, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify